//============================================================
//
//	エントリー画面ヘッダー [sceneEntry.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _SCENE_ENTRY_H_
#define _SCENE_ENTRY_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "main.h"
#include "scene.h"

//************************************************************
//	前方宣言
//************************************************************
class CEntryManager;	// エントリーマネージャークラス

//************************************************************
//	クラス定義
//************************************************************
// エントリー画面クラス
class CSceneEntry : public CScene
{
public:
	// コンストラクタ
	explicit CSceneEntry(const EMode mode);

	// デストラクタ
	~CSceneEntry();

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	HRESULT Uninit(void) override;	// 終了
	void Update(void) override;		// 更新
	void Draw(void) override;		// 描画

	// 静的メンバ関数
	static CEntryManager *GetEntryManager(void);	// エントリーマネージャー取得

private:
	// 静的メンバ変数
	static CEntryManager *m_pEntryManager;	// エントリーマネージャー
};

#endif	// _SCENE_ENTRY_H_
