//============================================================
//
//	フレイルエントリーヘッダー [flailEntry.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _FLAIL_ENTRY_H_
#define _FLAIL_ENTRY_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "main.h"
#include "flail.h"

//************************************************************
//	クラス定義
//************************************************************
// フレイルエントリークラス
class CFlailEntry : public CFlail
{
public:
	// コンストラクタ
	CFlailEntry();

	// デストラクタ
	~CFlailEntry();

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Update(void) override;		// 更新
	void Draw(void) override;		// 描画
};

#endif	// _FLAIL_ENTRY_H_
