//============================================================
//
//	ガイドヘッダー [guide.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _GUIDE_H_
#define _GUIDE_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "main.h"
#include "object3D.h"

//************************************************************
//	インクルードファイル
//************************************************************
class CObjectGauge3D;	// オブジェクトゲージ3Dクラス

//************************************************************
//	クラス定義
//************************************************************
// ガイドクラス
class CGuide : public CObject3D
{
public:
	// コンストラクタ
	CGuide();

	// デストラクタ
	~CGuide();

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Update(void) override;		// 更新
	void Draw(void) override;		// 描画

	// 静的メンバ関数
	static CGuide *Create	// 生成
	( // 引数
		const D3DXVECTOR3& rPos,	// 位置
		const D3DXVECTOR3& rSize	// 大きさ
	);
};

#endif	// _GUIDE_H_
