//============================================================
//
//	アイテムヘッダー [item.h]
//	Author：森川駿弥
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _ITEM_H_
#define _ITEM_H_
//************************************************************
//	インクルードファイル
//************************************************************
#include "main.h"

//************************************************************
//	クラス定義
//************************************************************
// アイテムクラス
class CItem
{
public:
	// アイテム列挙
	enum Item
	{
		ITEM_HEAL = 0,		// 回復
		ITEM_ATTACKUP,		// 攻撃力アップ
		ITEM_KNOCKBACK,		// ノックバックアップ
		ITEM_SUPERARMOR,	// スーパーアーマー
		ITEM_BIGIRONBALL,	// 巨大鉄球
		ITEM_TPIRONBALL,	// 透明鉄球
		ITEM_LONGCHAIN,		// 長い鎖
		ITEM_DOUBLEFLAIL,	// 複数フレイル
		ITEM_FILEFLAIL,		// 燃えてる鉄球
		ITEM_MAX
	};

	// コンストラクタ
	CItem();

	// デストラクタ
	~CItem();

	// メンバ関数
private:
	// メンバ変数
};

#endif