//============================================================
//
//	アイテムスポーンヘッダー [itemspawn.h]
//	Author：森川駿弥
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _ITEMSPAWN_H_
#define _ITEMSPAWN_H_
//************************************************************
//	インクルードファイル
//************************************************************
#include "main.h"
#include "objectmodel.h"

//************************************************************
//	クラス定義
//************************************************************
// アイテムクラス
class CItem : public CObjectModel
{
public:
	// コンストラクタ
	CItem();

	// デストラクタ
	~CItem();

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Update(void) override;		// 更新
	void Draw(void) override;		// 描画

	//メンバ関数
	void Collision();

	static CItem *Create(D3DXVECTOR3 pos);

private:
	// 静的メンバ変数
	static const char *ModelFileName;

	// メンバ変数
};

#endif
