//============================================================
//
//	アイテムスポーンヘッダー [itemspawn.h]
//	Author：森川駿弥
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _ITEMSPAWN_H_
#define _ITEMSPAWN_H_
//************************************************************
//	インクルードファイル
//************************************************************
#include "main.h"
#include "objectmodel.h"

//************************************************************
//	クラス定義
//************************************************************
// アイテムクラス
class CItemSpawn : public CObjectModel
{
public:
	// アイテム列挙
	enum ItemSpawn
	{
		ITEM_HEAL = 0,		// 回復
		ITEM_ATTACKUP,		// 攻撃力アップ
		ITEM_KNOCKBACK,		// ノックバックアップ
		ITEM_SUPERARMOR,	// スーパーアーマー
		ITEM_BIGIRONBALL,	// 巨大鉄球
		ITEM_TPIRONBALL,	// 透明鉄球
		ITEM_LONGCHAIN,		// 長い鎖
		ITEM_DOUBLEFLAIL,	// 複数フレイル
		ITEM_FILEFLAIL,		// 燃えてる鉄球
		ITEM_MAX
	};

	// コンストラクタ
	CItemSpawn();

	// デストラクタ
	~CItemSpawn();

	// メンバ関数

private:
	// 静的メンバ変数

	// メンバ変数
};

#endif
