//============================================================
//
//	遷移位置ヘッダー [nextPoint.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _NEXTPOINT_H_
#define _NEXTPOINT_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "main.h"
#include "object3D.h"

//************************************************************
//	インクルードファイル
//************************************************************
class CObjectGauge3D;	// オブジェクトゲージ3Dクラス

//************************************************************
//	クラス定義
//************************************************************
// 遷移位置クラス
class CNextPoint : public CObject3D
{
public:
	// コンストラクタ
	CNextPoint();

	// デストラクタ
	~CNextPoint();

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Update(void) override;		// 更新
	void Draw(void) override;		// 描画

	// 静的メンバ関数
	static CNextPoint *Create	// 生成
	( // 引数
		const D3DXVECTOR3& rPos,	// 位置
		const D3DXVECTOR3& rSize	// 大きさ
	);

private:
	// メンバ関数
	bool Collision(void);	// プレイヤー全員との当たり判定

	// メンバ変数
	CObjectGauge3D *m_pGauge;	// 待機ゲージ情報
};

#endif	// _NEXTPOINT_H_
